purewack/micropython/ports/esp32/boards/NUMCALCIUM_ESP32_S3/mpconfigboard.h
#ifndef MICROPY_HW_BOARD_NAME
// Can be set by mpconfigboard.cmake.
#define MICROPY_HW_BOARD_NAME               "NumCalcium (ESP32S3-Octal-SPIRAM)"
#endif
#define MICROPY_HW_MCU_NAME                 "ESP32S3"

#define MICROPY_BOARD_STARTUP               NUMCALCIUM_board_init
void NUMCALCIUM_board_init(void);

// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL         (0)
#define MICROPY_HW_ENABLE_ULP               (0)

#define MICROPY_HW_I2C0_SCL                 (9)
#define MICROPY_HW_I2C0_SDA                 (8)

#define MICROPY_HW_MODTEST (1) 
